Returns the Id of the host.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public ElementId HostId { get; }
  Visual Basic
Public ReadOnly Property HostId As ElementId
	Get
  Visual C++
public:
property ElementId^ HostId {
	ElementId^ get ();
}
 See Also
  FabricationHostedInfo Class
  Autodesk.Revit.DB Namespace